# Binaries
brew 'bat' # cat with highlighting
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg' 
brew 'jq'
brew 'micro' # Intuitive CLI editor with mouse-friendly navigation
brew 'poppler' # PDF tools
brew 'fzf' 
brew 'btop'
brew 'the_silver_searcher'
brew 'dust' # Alternative to du
brew 'zsh-autosuggestions'
# brew 'yt-dlp'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask 'keka' # Archiving tool
cask 'spotify'
cask 'firefox'
cask 'iterm2'
# Work machines usually have a 'managed' version of chrome so only uncomment this for personal devices
# cask 'google-chrome'

# Quicklook

cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'